In [203]:
import pandas as pd
import numpy as np

In [204]:
selloutData =pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [205]:
selloutData.head(1)

  REGIONID   PRODUCT  YEARWEEK   QTY
0      A60  PRODUCT4    201402  71.0

In [206]:
selloutData["NEW_QTY"] = np.where(selloutData["QTY"]<0 ,0, selloutData["QTY"])

In [207]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY
0      A60   PRODUCT4    201402     71.0     71.0
1      A60  PRODUCT59    201402  22275.0  22275.0
2      A60  PRODUCT34    201402   4463.0   4463.0
3      A60  PRODUCT47    201402      0.0      0.0
4      A60  PRODUCT56    201402     23.0     23.0

### 53주차 제거

In [208]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY     float64
dtype: object

week분리

In [209]:
selloutData["WEEK"] = selloutData["YEARWEEK"]%100

year분리

##### 함수 만들기

In [210]:
def customFuntion(inputColumn):
    inputColumn =201601
    yearValue =inputColumn/100
    yearValue = int(yearValue)
    return yearValue

##### YEAR 컬럼 만들고 위 함수 적용하기

In [211]:
selloutData["YEAR"] =selloutData["YEARWEEK"].apply(customFuntion)

In [212]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2016
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2016
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2016
3      A60  PRODUCT47    201402      0.0      0.0     2  2016
4      A60  PRODUCT56    201402     23.0     23.0     2  2016

##### 1) round함수 /가 아니고 // 하면 소숫점 아래자리가 반올림되어 정수형으로 변화 ( 근데 round함수는 반올림을 하기 때문에 50주차 이상이되면 반올림이 되어 연수가 올라가기 때문에 적합하지 않은 방법임)

In [213]:
selloutData["YEAR"] = round(selloutData["YEARWEEK"]//100)

In [214]:
refinedData = selloutData[selloutData.WEEK < 53]

In [215]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

##### 2 )따라서 int형으로 형 변환을 해주는 게 적합한 방법임

In [216]:
##refinedData = selloutData[selloutData.YEARWEEK%100 < 53]

In [217]:
##refinedData["TEST"] = ((selloutData["YEARWEEK"]/100).astype(int))

In [218]:
##refinedData.head()

###  깰끔~ 해보이기 위해서 정렬!

In [219]:
sortKey = ["REGIONID","PRODUCT", "YEARWEEK"]

In [220]:
sortedData = refinedData.sort_values(sortKey)

In [221]:
sortedData.head()

     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
298       A00  PRODUCT34    201401  661.0    661.0     1  2014
1757      A00  PRODUCT34    201402  679.0    679.0     2  2014
3125      A00  PRODUCT34    201403  578.0    578.0     3  2014
205       A00  PRODUCT34    201404  532.0    532.0     4  2014
4369      A00  PRODUCT34    201405  516.0    516.0     5  2014

##### 여기서 앞 줄 인덱스가 걸리적 거린다면

In [222]:
step1Data =sortedData.reset_index(drop=True)

In [223]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
0      A00  PRODUCT34    201401  661.0    661.0     1  2014
1      A00  PRODUCT34    201402  679.0    679.0     2  2014
2      A00  PRODUCT34    201403  578.0    578.0     3  2014
3      A00  PRODUCT34    201404  532.0    532.0     4  2014
4      A00  PRODUCT34    201405  516.0    516.0     5  2014

### rolling 함수 사용하기!! (정렬을 하고 사용해야 함)

1.기본 이동평균 함수

In [82]:
step1Data["MA"]=step1Data.NEW_QTY.rolling(window=15, center=True).mean()

In [83]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014 NaN
1      A00  PRODUCT34    201402  679.0    679.0     2  2014 NaN
2      A00  PRODUCT34    201403  578.0    578.0     3  2014 NaN
3      A00  PRODUCT34    201404  532.0    532.0     4  2014 NaN
4      A00  PRODUCT34    201405  516.0    516.0     5  2014 NaN

#### 위에서 NAN을 없애려면 어떻게 해야 할까?

##### min_period 이용--rolling함수:이동평균 구하는 함수, 
##### 해석 : (window=15:총 15개의 이동평균을 구하겠다, center=true: 내 자신을 7번째로, 즉 가운데로 놓고 이동평균을 구하겠다, min_periods =1 : 원래는 평균이 15개의 값을 구해야 하지만 최소로 1개 있을 때도 평균을 구하겠다, .mean()는 평균을 구하겠다-> .max(), .min()등으로 사용에 따라 변경 가능 )

In [84]:
step1Data["MA"] = step1Data.NEW_QTY.rolling(
    window=15, center=True, min_periods =1).mean()

In [85]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR          MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  520.000000
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  514.444444
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  516.800000
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  503.363636
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  490.750000

#### result라는 csv 파일로 ./ 현재 경로에 저장하는 명령어

In [86]:
step1Data.to_csv("./result.csv")

In [87]:
pwd

'C:\\Users\\SMART-12\\Python_Fintech\\4.04 Project Seasonality'

### merge

In [168]:
groupKey = ["REGIONID","PRODUCT","YEAR"]

In [169]:
selectedData=step1Data.groupby(groupKey)[["NEW_QTY"]].mean()

윗줄의 new_qty를 이름만 qty_new로 바꾼것 (아랫줄)

In [196]:
selectedData.columns=["QTY_NEW"]

In [197]:
selectedData.head()

                            QTY_NEW
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538
                   2015   86.634615
                   2016   36.576923
         PRODUCT58 2014    2.673077
                   2015    5.711538

데이터 합치기

In [172]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR          MA
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  520.000000
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  514.444444
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  516.800000
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  503.363636
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  490.750000

### ##selectedData를 다시 인덱스 형식으로 바꿔준다 (데이터를 조인 시키려면 인덱스 형식이어야 함)

In [199]:
spiltedData=selectedData.reset_index(drop=False)
spiltedData.head()

  REGIONID    PRODUCT  YEAR     QTY_NEW
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

### 데이터 조인

In [174]:
mergeKey = ["REGIONID", "PRODUCT", "YEAR"]

In [233]:
##left_on과 right_on의 값이 같으면 on=mergeKey로 해도됨
mergedData= pd.merge(step1Data, spiltedData,\
                    left_on = mergeKey,right_on = mergeKey, \
                      how = "left")
mergedData.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR     QTY_NEW
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  275.961538
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  275.961538
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  275.961538
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  275.961538
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  275.961538

In [176]:
mergedData

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA,QTY_NEW
0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,275.961538
1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,275.961538
2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,275.961538
3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,275.961538
4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,275.961538
5,A00,PRODUCT34,201406,423.0,423.0,6,2014,480.230769,275.961538
6,A00,PRODUCT34,201407,407.0,407.0,7,2014,468.214286,275.961538
7,A00,PRODUCT34,201408,364.0,364.0,8,2014,456.666667,275.961538
8,A00,PRODUCT34,201409,470.0,470.0,9,2014,431.533333,275.961538
9,A00,PRODUCT34,201410,538.0,538.0,10,2014,402.066667,275.961538
10,A00,PRODUCT34,201411,369.0,369.0,11,2014,375.533333,275.961538
11,A00,PRODUCT34,201412,352.0,352.0,12,2014,350.800000,275.961538
12,A00,PRODUCT34,201413,354.0,354.0,13,2014,325.733333,275.961538
13,A00,PRODUCT34,201414,312.0,312.0,14,2014,305.266667,275.961538
14,A00,PRODUCT34,201415,295.0,295.0,15,2014,284.666667,275.961538
15,A00,PRODUCT34,201416,284.0,284.0,16,2014,265.933333,275.961538
16,A00,PRODUCT34,201417,237.0,237.0,17,2014,239.333333,275.961538
17,A00,PRODUCT34,201418,180.0,180.0,18,2014,207.800000,275.961538
18,A00,PRODUCT34,201419,161.0,161.0,19,2014,187.200000,275.961538
19,A00,PRODUCT34,201420,140.0,140.0,20,2014,169.200000,275.961538
20,A00,PRODUCT34,201421,116.0,116.0,21,2014,155.666667,275.961538
21,A00,PRODUCT34,201422,98.0,98.0,22,2014,153.133333,275.961538
22,A00,PRODUCT34,201423,83.0,83.0,23,2014,168.933333,275.961538
23,A00,PRODUCT34,201424,71.0,71.0,24,2014,179.933333,275.961538
24,A00,PRODUCT34,201425,65.0,65.0,25,2014,193.000000,275.961538
25,A00,PRODUCT34,201426,60.0,60.0,26,2014,205.266667,275.961538
26,A00,PRODUCT34,201427,82.0,82.0,27,2014,217.600000,275.961538
27,A00,PRODUCT34,201428,151.0,151.0,28,2014,229.066667,275.961538
28,A00,PRODUCT34,201429,274.0,274.0,29,2014,237.600000,275.961538
29,A00,PRODUCT34,201430,532.0,532.0,30,2014,246.200000,275.961538
...,...,...,...,...,...,...,...,...,...
123834,A77,PRODUCT12,201623,5348.0,5348.0,23,2016,4159.933333,4837.153846
123835,A77,PRODUCT12,201624,3275.0,3275.0,24,2016,4272.333333,4837.153846
123836,A77,PRODUCT12,201625,4158.0,4158.0,25,2016,4435.133333,4837.153846
123837,A77,PRODUCT12,201626,4815.0,4815.0,26,2016,4530.533333,4837.153846
123838,A77,PRODUCT12,201627,3002.0,3002.0,27,2016,4518.466667,4837.153846
123839,A77,PRODUCT12,201628,3319.0,3319.0,28,2016,4527.000000,4837.153846
123840,A77,PRODUCT12,201629,4200.0,4200.0,29,2016,4528.533333,4837.153846
123841,A77,PRODUCT12,201630,7120.0,7120.0,30,2016,4402.866667,4837.153846
123842,A77,PRODUCT12,201631,6345.0,6345.0,31,2016,4418.533333,4837.153846
123843,A77,PRODUCT12,201632,5863.0,5863.0,32,2016,5182.466667,4837.153846
123844,A77,PRODUCT12,201633,4211.0,4211.0,33,2016,5145.466667,4837.153846
123845,A77,PRODUCT12,201634,4019.0,4019.0,34,2016,5091.800000,4837.153846
123846,A77,PRODUCT12,201635,3624.0,3624.0,35,2016,5177.800000,4837.153846
123847,A77,PRODUCT12,201636,3742.0,3742.0,36,2016,5340.533333,4837.153846
123848,A77,PRODUCT12,201637,3002.0,3002.0,37,2016,5334.466667,4837.153846
123849,A77,PRODUCT12,201638,5583.0,5583.0,38,2016,5160.200000,4837.153846
123850,A77,PRODUCT12,201639,14734.0,14734.0,39,2016,5020.866667,4837.153846
123851,A77,PRODUCT12,201640,3603.0,3603.0,40,2016,4868.266667,4837.153846
123852,A77,PRODUCT12,201641,4010.0,4010.0,41,2016,4864.333333,4837.153846
123853,A77,PRODUCT12,201642,4292.0,4292.0,42,2016,4935.466667,4837.153846
123854,A77,PRODUCT12,201643,5760.0,5760.0,43,2016,5083.600000,4837.153846
123855,A77,PRODUCT12,201644,4109.0,4109.0,44,2016,5163.000000,4837.153846
123856,A77,PRODUCT12,201645,4506.0,4506.0,45,2016,5466.266667,4837.153846
123857,A77,PRODUCT12,201646,4255.0,4255.0,46,2016,5457.928571,4837.153846
123858,A77,PRODUCT12,201647,3574.0,3574.0,47,2016,4744.384615,4837.153846
123859,A77,PRODUCT12,201648,4152.0,4152.0,48,2016,4839.500000,4837.153846
123860,A77,PRODUCT12,201649,5086.0,5086.0,49,2016,4914.909091,4837.153846
123861,A77,PRODUCT12,201650,5846.0,5846.0,50,2016,4977.200000,4837.153846
123862,A77,PRODUCT12,201651,4933.0,4933.0,51,2016,4890.222222,4837.153846
123863,A77,PRODUCT12,201652,7551.0,7551.0,52,2016,4987.875000,4837.153846

데이터가 3배 늘어난다- mergeKey에서 요소 year을 빼니까 데이터 량이 늘어나는데, 총 3년이 있어서 3배가 늘어난다는 뜻의 아래 코드이다.

In [177]:
## mergeKey2 = ["REGIONID", "PRODUCT"]

In [178]:
## mergedData2 = pd.merge(step1Data, spiltedData,\
##                     left_on = mergeKey2, right_on = mergeKey2,\
##                     how = "left")
## mergedData2.head()

mergedData를 csv파일로 현재 경로에 저장

In [179]:
## mergedData.to_csv("./mergedData.csv")

## 그룹바이함수 만들기

In [243]:
groupKey = ["REGIONID","PRODUCT"]

In [244]:
def groupFunction(eachGroup):
    eachGroup["MA3"] =eachGroup["NEW_QTY"]

In [246]:
mergedData.groupby(groupKey).apply(groupFunction)
mergedData.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR     QTY_NEW
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  275.961538
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  275.961538
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  275.961538
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  275.961538
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  275.961538

In [180]:
groupKey2 = ["REGIONID","PRODUCT"]

In [181]:
groupDataSet =mergedData.groupby(groupKey2)

In [182]:
def groupRolling(groupDataSet):
   
    #len(list(groupDataSet.groups))
    
    #oneGroup = groupDataSet.get_group(list(groupDataSet.groups)[2])
    #oneGroup.head(1)

    indexGroupData = oneGroup.reset_index(drop=True)
    indexGroupData["MA2"] = indexGroupData["NEW_QTY"].rolling(window=5,center=True).mean()
   
    return indexGroupData

In [183]:
oneGroup = groupDataSet.get_group(list(groupDataSet.groups)[2])

In [184]:
oneGroup.head()

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA,QTY_NEW
312,A00,PRODUCT59,201401,9988.0,9988.0,1,2014,6299.933333,27418.692308
313,A00,PRODUCT59,201402,9005.0,9005.0,2,2014,7296.333333,27418.692308
314,A00,PRODUCT59,201403,8416.0,8416.0,3,2014,8346.600000,27418.692308
315,A00,PRODUCT59,201404,8553.0,8553.0,4,2014,9418.600000,27418.692308
316,A00,PRODUCT59,201405,10355.0,10355.0,5,2014,10564.200000,27418.692308

In [185]:
finalResult = mergedData.groupby(groupKey2).apply(groupRolling)

In [234]:
finalResult.head()

                     REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT59    201401   9988.0   9988.0     1
                   1      A00  PRODUCT59    201402   9005.0   9005.0     2
                   2      A00  PRODUCT59    201403   8416.0   8416.0     3
                   3      A00  PRODUCT59    201404   8553.0   8553.0     4
                   4      A00  PRODUCT59    201405  10355.0  10355.0     5

                      YEAR            MA       QTY_NEW      MA2
REGIONID PRODUCT
A00      PRODUCT34 0  2014   6299.933333  27418.692308      NaN
                   1  2014   7296.333333  27418.692308      NaN
                   2  2014   8346.600000  27418.692308   9263.4
                   3  2014   9418.600000  27418.692308  10025.6
                   4  2014  10564.200000  27418.692308  11683.0

groupdataset의 데이터 량 검색(groupkey2=regionid,product를 기준으로 묶은 그룹이 794개가 있다)

In [187]:
len(list(groupDataSet.groups))

794

groupDataSet아래 onegroup을 왜할까?  롤링함수를 써서 seasonality를 단순하게 구하고 싶기 때문이다.
모든 데이터를 롤링시키면 추세선이 이상해질 수 있다. 그러니까, 어떤 지역에 대한 추세선을 만들고 싶으면 해당 그룹만의 롤링을 구하는 것이 좋음(롤링이란 이동평균 구하는거)

첫번째 인덱스 [0]

In [188]:
oneGroup1 = groupDataSet.get_group(list(groupDataSet.groups)[0])
oneGroup1.head()

,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA,QTY_NEW
0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,275.961538
1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,275.961538
2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,275.961538
3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,275.961538
4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,275.961538

In [189]:
indexGroupData = oneGroup.reset_index(drop=True)
indexGroupData["MA2"] = indexGroupData["NEW_QTY"].rolling(window=5, center=True).mean()